#!/bin/bash
#set -eux
# r2 命令的使用

intro_r2_command(){
    echo "--------------------------------------------"
    echo "首先让我们打开r2 并使用 r2 -h 开始查看帮助."
    echo "--------------------------------------------"    


}

r2_demo1(){
read -n1 -p "开始教程? [Y/N]?" answer
case $answer in
Y | y)
      echo "--------开始一个最简单的使用说明----------------"
      echo "r2 ./可执行文件 用R2打开一个程序 "
      echo " 在命令行输入 shift + v 查看二进制代码 "
      ;;
N | n)
      echo "退出教程"
       exit 0
      ;;
*)
     echo "退出教程"
     exit 0
     ;;
esac
}

#######################################主执行目录#################################
#切换目录,没有就创建
#查看路径是否存在
main(){

intro_r2_command;
r2_demo1;

}

main

